# DVD rental analysis

### We use a sample postgreSQL database to analyze DVD rentals over time. 

##### For this exercise, we have set up a postgreSQL database, and imported a sample database that covers DVD rentals. 

The DVD relational database has 15 tables, representing DVD rental behavior by various dimensions and metrics. These tables provide insight into the customers, staff, movie titles and rental time periods. 

In this Jupyter notebook, we will focus on using SQL to transform, explore and *__project__* this rental data for future periods. We will then store this information in pandas dataframes, in order to produce summary statistics and graphical represenations of the data using matplotlib. 

__Table of contents:__

* [Section 1: SQL setup](#Section-1-SQL-setup)
* [Section 2: Exploring dataset](#Section-2-Exploring-dataset)
* [Section 3: DVD demand regression](#Section-3-DVD-demand-regression)
* [Section 4: Forecasting DVD demand](#Section-4-Forecasting_dvd_demand)
* [Section 5: Projecting DVD demand](#Section-5-Projecting-next-6-months)

<a id='Section-1-SQL-setup'></a>

---

### The following cells exist to install necessary modules and functionalities for quering a postgresQL database within a Jupyter notebook.

In [32]:
# Installing sqlalchemy, a library to interact with various databases (including postgreSQL)
!pip install sqlalchemy

# Install necessary postgres module to work interface with sqlalchemy
!pip install psycopg2

# Install ipython-sql to enable magic command querying through sqlalchemy
!pip install ipython-sql

Requirement already satisfied: sqlalchemy in ./lib/python3.9/site-packages (1.4.46)
Requirement already satisfied: greenlet!=0.4.17 in ./lib/python3.9/site-packages (from sqlalchemy) (2.0.1)
WARNING: You are using pip version 22.0.4; however, version 22.3.1 is available.
You should consider upgrading via the '/Users/tylerstevenson/Portfolio/portfolio_database/bin/python3 -m pip install --upgrade pip' command.
Requirement already satisfied: psycopg2 in ./lib/python3.9/site-packages (2.9.5)
WARNING: You are using pip version 22.0.4; however, version 22.3.1 is available.
You should consider upgrading via the '/Users/tylerstevenson/Portfolio/portfolio_database/bin/python3 -m pip install --upgrade pip' command.
Requirement already satisfied: ipython-sql in ./lib/python3.9/site-packages (0.4.1)
Requirement already satisfied: ipython-genutils>=0.1.0 in ./lib/python3.9/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython>=1.0 in ./lib/python3.9/site-packages (from ipython-sql) (8.8.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in ./lib/python3.9/site-packages (from ipython-sql) (1.4.46)
Requirement already satisfied: prettytable<1 in ./lib/python3.9/site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: six in ./lib/python3.9/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlparse in ./lib/python3.9/site-packages (from ipython-sql) (0.4.3)
Requirement already satisfied: decorator in ./lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: stack-data in ./lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.6.2)
Requirement already satisfied: pexpect>4.3 in ./lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: pygments>=2.4.0 in ./lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (2.14.0)
Requirement already satisfied: jedi>=0.16 in ./lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.18.2)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.11 in ./lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (3.0.36)
Requirement already satisfied: traitlets>=5 in ./lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (5.8.0)
Requirement already satisfied: appnope in ./lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.1.3)
Requirement already satisfied: pickleshare in ./lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: matplotlib-inline in ./lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.1.6)
Requirement already satisfied: backcall in ./lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: greenlet!=0.4.17 in ./lib/python3.9/site-packages (from sqlalchemy>=0.6.7->ipython-sql) (2.0.1)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in ./lib/python3.9/site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in ./lib/python3.9/site-packages (from pexpect>4.3->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in ./lib/python3.9/site-packages (from prompt-toolkit<3.1.0,>=3.0.11->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: executing>=1.2.0 in ./lib/python3.9/site-packages (from stack-data->ipython>=1.0->ipython-sql) (1.2.0)
Requirement already satisfied: pure-eval in ./lib/python3.9/site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.2.2)
Requirement already satisfied: asttokens>=2.1.0 in ./lib/python3.9/site-packages (from stack-data->ipython>=1.0->ipython-sql) (2.2.1)
WARNING: You are using pip version 22.0.4; however, version 22.3.1 is available.
You should consider upgrading via the '/Users/tylerstevenson/Portfolio/portfolio_database/bin/python3 -m pip install --upgrade pip' command.

In [2]:
# Importing necessary packages to query our postgresql database

import sqlalchemy
import psycopg2

# ipython-sql does not need to be imported like the other modules - it enables magic commands in jupyter notebook,
#  to run SQL within a code cell

In [3]:
# Define endpoint for sqlalchemy.engine to interface with postgres

engine = sqlalchemy.create_engine('postgresql://postgres:W4ac8s-Dkpth@localhost:5432/dvdrental')

In [4]:
# Loading magic commands from ipython-sql, and necessary parameters for querying the database through sqlalchemy

%load_ext sql
%sql $engine.url

In [5]:
%%sql

-- Testing SQL connection

SELECT actor_id, first_name
from actor
WHERE first_name = 'Ed'

 * postgresql://postgres:***@localhost:5432/dvdrental
3 rows affected.

[(3, 'Ed'), (136, 'Ed'), (179, 'Ed')]

<a id='Section-2-Exploring-dataset'></a>

----

### Our next block of cells will focus on some exploratory work with the DVD rental database. 
###### We will experiement with the tables available, to understand more about their makeup. We can use this exploratory exercise to plan some deeper dives in a later analysis.

In [11]:
%%sql

-- List out all tables that exist in the database

SELECT table_name
FROM information_schema.tables
WHERE table_schema='public'
AND table_type='BASE TABLE';

 * postgresql://postgres:***@localhost:5432/dvdrental
15 rows affected.

[('actor',),
 ('store',),
 ('address',),
 ('category',),
 ('city',),
 ('country',),
 ('customer',),
 ('film_actor',),
 ('film_category',),
 ('inventory',),
 ('language',),
 ('rental',),
 ('staff',),
 ('payment',),
 ('film',)]

In [27]:
%%sql

-- Summarizing the total number of tables available in this database

SELECT count(distinct table_name) as num_tables
FROM information_schema.tables
WHERE 1=1
AND table_schema = 'public'
AND table_type = 'BASE TABLE'

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(15,)]

In [73]:
%%sql

select * from actor limit 5

 * postgresql://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(1, 'Penelope', 'Guiness', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000)),
 (2, 'Nick', 'Wahlberg', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000)),
 (3, 'Ed', 'Chase', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000)),
 (4, 'Jennifer', 'Davis', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000)),
 (5, 'Johnny', 'Lollobrigida', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000))]

In [74]:
%%sql

select * from rental limit 5

 * postgresql://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(2, datetime.datetime(2005, 5, 24, 22, 54, 33), 1525, 459, datetime.datetime(2005, 5, 28, 19, 40, 33), 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (3, datetime.datetime(2005, 5, 24, 23, 3, 39), 1711, 408, datetime.datetime(2005, 6, 1, 22, 12, 39), 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (4, datetime.datetime(2005, 5, 24, 23, 4, 41), 2452, 333, datetime.datetime(2005, 6, 3, 1, 43, 41), 2, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (5, datetime.datetime(2005, 5, 24, 23, 5, 21), 2079, 222, datetime.datetime(2005, 6, 2, 4, 33, 21), 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (6, datetime.datetime(2005, 5, 24, 23, 8, 7), 2792, 549, datetime.datetime(2005, 5, 27, 1, 32, 7), 1, datetime.datetime(2006, 2, 16, 2, 30, 53))]

In [8]:
%%sql

select table_name, column_name, data_type
from information_schema.columns
where table_name in ('film','inventory','film_actor')
order by table_name, ordinal_position

 * postgresql://postgres:***@localhost:5432/dvdrental
20 rows affected.

[('film', 'film_id', 'integer'),
 ('film', 'title', 'character varying'),
 ('film', 'description', 'text'),
 ('film', 'release_year', 'integer'),
 ('film', 'language_id', 'smallint'),
 ('film', 'rental_duration', 'smallint'),
 ('film', 'rental_rate', 'numeric'),
 ('film', 'length', 'smallint'),
 ('film', 'replacement_cost', 'numeric'),
 ('film', 'rating', 'USER-DEFINED'),
 ('film', 'last_update', 'timestamp without time zone'),
 ('film', 'special_features', 'ARRAY'),
 ('film', 'fulltext', 'tsvector'),
 ('film_actor', 'actor_id', 'smallint'),
 ('film_actor', 'film_id', 'smallint'),
 ('film_actor', 'last_update', 'timestamp without time zone'),
 ('inventory', 'inventory_id', 'integer'),
 ('inventory', 'film_id', 'smallint'),
 ('inventory', 'store_id', 'smallint'),
 ('inventory', 'last_update', 'timestamp without time zone')]

### The query below demonstrates the narrow scope of each table in this database. 

Any analysis involving a combination of film titles, film cateogries, rental counts and rental locations will necessitate several joins, as we see below.

In [139]:
%%sql

-- Here, we do a sample join across several tables to determine what the top ranking
-- titles are, in descending order, by count of rentals.

select film.title
    , count(distinct rental_id) as num_rentals
    from film 
    left outer join film_actor
        on film.film_id = film_actor.film_id
    left outer join actor
        on film_actor.actor_id = actor.actor_id
    left outer join inventory
        on film.film_id = inventory.inventory_id
    left outer join rental
        on inventory.inventory_id = rental.inventory_id
group by 1
order by 2 desc
limit 10

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[('Arizona Bang', 5),
 ('Armageddon Lost', 5),
 ('Alone Trip', 5),
 ('Anything Savannah', 5),
 ('Agent Truman', 5),
 ('Annie Identity', 5),
 ('Ace Goldfinger', 5),
 ('Alice Fantasia', 5),
 ('Anaconda Confessions', 5),
 ('Army Flintstones', 5)]

In [25]:
%%sql

-- Summarizing count of rental records by year and month

with base_calcs as (
    select DATE_PART('year',rental_date) as rental_year
    , DATE_PART('month',rental_date) as rental_month
    , DATE_PART('year',rental_date) || '-' || DATE_PART('month',rental_date) as rental_year_month
    , (DATE_PART('day',return_date) - DATE_PART('day',rental_date)) as days_rented
    , rental_id
    from rental
    where 1=1
    )
select rental_year
, rental_year_month
, count(distinct rental_id) as num_rentals
from base_calcs
where 1=1
group by 1,2
order by 2 asc

 * postgresql://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(2005.0, '2005-5', 1156),
 (2005.0, '2005-6', 2311),
 (2005.0, '2005-7', 6709),
 (2005.0, '2005-8', 5686),
 (2006.0, '2006-2', 182)]

<a id='Section-3-DVD-demand-regression'></a>

---

# Simple regression of DVD category rental demand

### Let's use SQL and our database history to model monthly DVD rentals. Typically, this would be something best-suited for Python, but we will experiment with using SQL for this use case. 

First, we will start by pulling some sample information from the tables we will need to leverage. Then, we can switch to modelling our forecasts, using a very simple linear trend to extrapolate. 

We will limit our forecasting exercise to the top 5 categories by rental volume, and __exclude Feb 2006 data__, as it appears to be partial.

In [140]:
%%sql

-- Development query to 'search' for specific column names across tables, to identify joins easily

select table_name, column_name
from information_schema.columns
where column_name = 'category_id'

 * postgresql://postgres:***@localhost:5432/dvdrental
2 rows affected.

[('category', 'category_id'), ('film_category', 'category_id')]

In [62]:
%%sql

-- Pulling sample data and metadata from the tables we will require; we will use this info as 
-- a cheat sheet for crafting joins

select table_name, column_name, data_type
from information_schema.columns
where 1=1
and table_name = 'film_category'

union all

select table_name, column_name, data_type
from information_schema.columns
where 1=1
and table_name = 'film'
and column_name in ('film_id','release_year')

union all

select table_name, column_name, data_type
from information_schema.columns
where 1=1
and table_name = 'rental'
and column_name in ('rental_id','rental_date','inventory_id')

union all

select table_name, column_name, data_type
from information_schema.columns
where 1=1
and table_name = 'inventory'
and column_name in ('inventory_id','film_id','store_id')

union all

select table_name, column_name, data_type
from information_schema.columns
where 1=1
and table_name = 'category'
--and column_name in ('category_id','name')

 * postgresql://postgres:***@localhost:5432/dvdrental
14 rows affected.

[('film_category', 'film_id', 'smallint'),
 ('film_category', 'category_id', 'smallint'),
 ('film_category', 'last_update', 'timestamp without time zone'),
 ('film', 'film_id', 'integer'),
 ('film', 'release_year', 'integer'),
 ('rental', 'rental_id', 'integer'),
 ('rental', 'rental_date', 'timestamp without time zone'),
 ('rental', 'inventory_id', 'integer'),
 ('inventory', 'inventory_id', 'integer'),
 ('inventory', 'film_id', 'smallint'),
 ('inventory', 'store_id', 'smallint'),
 ('category', 'category_id', 'integer'),
 ('category', 'last_update', 'timestamp without time zone'),
 ('category', 'name', 'character varying')]

In [141]:
%%sql

-- Adding functionality for pivoting data through the crosstab function

CREATE EXTENSION IF NOT EXISTS tablefunc;

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.

[]

In [ ]:
%%sql

-- Need to print the top 5 categories

In [138]:
%%sql 

-- This is a development query, creating a single regression trend line for category 1 (cat_1)

-- Execution order, high level:
-- 1. Creating a base set of data for top 5 film categories, by rental volume
-- 2. Pivoting this base dataset, where columns contain an individual categories rental volume by month
-- 3. Establihing the stastical values for slope and intercept, derived from historical data
-- 4. Returning the trend line for category 1

Notes: 

-- Crosstab is necessary to pivot category data into columns, for statistical inference of slope and intercept


with pivoted_data as (
select * from crosstab (
$$
with base_data_collect as (
    select c.name, f.release_year, r.rental_date, r.rental_id
    from category c
    left outer join film_category f_c
        on c.category_id = f_c.category_id
    left outer join film f
        on f_c.film_id = f.film_id
    left outer join inventory i
        on f.film_id = i.film_id
    left outer join rental r
        on i.inventory_id = r.inventory_id
),
biz_logic_applied as (
    select *
        , case when release_year = DATE_PART('year',rental_date) then 'recent_release' 
            else 'old_release' end as recency_category
        , DATE_PART('year',rental_date) || '-' || DATE_PART('month',rental_date) as year_month
    from base_data_collect
),
top_5_cats as (
    select name, count(distinct rental_id) as num_rentals
    from base_data_collect
    group by 1
    order by 2 desc
    limit 5

)
    select bl.year_month, t5.name, count(distinct bl.rental_id) as num_rentals
    from biz_logic_applied bl
    inner join top_5_cats t5
        on bl.name = t5.name
    where bl.year_month != '2006-2'
    group by 1,2
    order by 1 asc $$
, $$ 
    with base_data_collect as (
    select c.name, f.release_year, r.rental_date, r.rental_id
    from category c
    left outer join film_category f_c
        on c.category_id = f_c.category_id
    left outer join film f
        on f_c.film_id = f.film_id
    left outer join inventory i
        on f.film_id = i.film_id
    left outer join rental r
        on i.inventory_id = r.inventory_id
),
top_5_cats as (
    select name, count(distinct rental_id) as num_rentals
    from base_data_collect
    group by 1
    order by 2 desc
    limit 5
)
    select name from top_5_cats
    $$)
    as sales_summary(month_year varchar, cat_1 int, cat_2 int, cat_3 int, cat_4 int, cat_5 int)

),
stat_projection_prep as (
    select rank() over (order by month_year) as ranking, *
    from pivoted_data
),
stat_projection_1 as (
    select ranking, avg(ranking) over() as ranking_bar
    , cat_1, avg(cat_1) over() as cat_1_bar
    from stat_projection_prep
),
stat_projection_2 as (
    select SUM((ranking - ranking_bar) * (cat_1 - cat_1_bar)) / SUM((ranking - ranking_bar) * (ranking - ranking_bar)) as slope
    , MAX(ranking_bar) as ranking_bar_max
    , MAX(cat_1_bar) as cat_1_bar_max
    from stat_projection_1
),
trend_line as (
    select slope, cat_1_bar_max - ranking_bar_max * slope intercept
    from stat_projection_2
)
    select spp.*
    , round((spp.ranking * (select slope from trend_line) + (select intercept from trend_line)),2) as trend_line_1
    from stat_projection_prep spp

 * postgresql://postgres:***@localhost:5432/dvdrental
4 rows affected.

[(1, '2005-5', 76, 74, 87, 84, 85, Decimal('80.10')),
 (2, '2005-6', 159, 174, 160, 162, 154, Decimal('220.70')),
 (3, '2005-7', 497, 489, 464, 462, 460, Decimal('361.30')),
 (4, '2005-8', 432, 408, 384, 385, 384, Decimal('501.90'))]

### The above code block gets us a single trend line, based on the column cat_1. To iterate the calculations over cat_2 -> cat_5, we will need to expand our original query to include the other columns.  We will perform this exercise in the next section of our analysis. 

#### This gets verbose quickly, and is not practical for performing via SQL. Python would be much better suited for an operation that requires a looping calculation. However, the below queries showcase how this could be accomplished if you were unable to leverage Python.

<a id='Section-4-Forecasting_dvd_demand'></a>

----

## DVD rental projection - forward looking

#### Below we run a simple linear regression analysis on the top 5 categories in our DVD rental dataset, and calculate future month's values based on this linear regression, by category. 

### Execution notes:
* For a deeper dive into the "core" logic of this query, check out the comments in the cell above 
* The results below are stored in a temporary table called "training_values", to improve readability for future analysis
* Along with the trend lines per category, we also return the slope and intercept values per category - these values will drive our forecasts in later queries

In [142]:
%%sql

-- Predicting demand for the upcoming Q4 2006 season, for the top 5 categories of movie rentals
-- Crosstab exists initially to pivot data - the output will be then fed into a new series of CTEs
-- First CTE focuses on joining all necessary tables for rental volume by category
-- Second CTE focuses on layering in biz logic for categorizing movies based on recency
-- storing our dataset into a temp table

DROP TABLE IF EXISTS training_values; 

create temporary table training_values as (

with pivoted_data as (
select * from crosstab (
$$
with base_data_collect as (
    select c.name, f.release_year, r.rental_date, r.rental_id
    from category c
    left outer join film_category f_c
        on c.category_id = f_c.category_id
    left outer join film f
        on f_c.film_id = f.film_id
    left outer join inventory i
        on f.film_id = i.film_id
    left outer join rental r
        on i.inventory_id = r.inventory_id
),
biz_logic_applied as (
    select *
        , case when release_year = DATE_PART('year',rental_date) then 'recent_release' 
            else 'old_release' end as recency_category
        , DATE_PART('year',rental_date) || '-' || DATE_PART('month',rental_date) as year_month
    from base_data_collect
),
top_5_cats as (
    select name, count(distinct rental_id) as num_rentals
    from base_data_collect
    group by 1
    order by 2 desc
    limit 5

)
    select bl.year_month, t5.name, count(distinct bl.rental_id) as num_rentals
    from biz_logic_applied bl
    inner join top_5_cats t5
        on bl.name = t5.name
    where bl.year_month != '2006-2'
    group by 1,2
    order by 1 asc $$
, $$ 
    with base_data_collect as (
    select c.name, f.release_year, r.rental_date, r.rental_id
    from category c
    left outer join film_category f_c
        on c.category_id = f_c.category_id
    left outer join film f
        on f_c.film_id = f.film_id
    left outer join inventory i
        on f.film_id = i.film_id
    left outer join rental r
        on i.inventory_id = r.inventory_id
),
top_5_cats as (
    select name, count(distinct rental_id) as num_rentals
    from base_data_collect
    group by 1
    order by 2 desc
    limit 5
)
    select name from top_5_cats
    $$)
    as sales_summary(month_year varchar, cat_1 int, cat_2 int, cat_3 int, cat_4 int, cat_5 int)

),
stat_projection_prep as (
    select rank() over (order by month_year) as ranking, *
    from pivoted_data
),
stat_projection_1 as (
    select ranking, avg(ranking) over() as ranking_bar
    , cat_1, avg(cat_1) over() as cat_1_bar
    , cat_2, avg(cat_2) over() as cat_2_bar
    , cat_3, avg(cat_3) over() as cat_3_bar
    , cat_4, avg(cat_4) over() as cat_4_bar
    , cat_5, avg(cat_5) over() as cat_5_bar
    from stat_projection_prep
),
stat_projection_2 as (
    select SUM((ranking - ranking_bar) * (cat_1 - cat_1_bar)) / SUM((ranking - ranking_bar) * (ranking - ranking_bar)) as slope_1
    , SUM((ranking - ranking_bar) * (cat_2 - cat_2_bar)) / SUM((ranking - ranking_bar) * (ranking - ranking_bar)) as slope_2
    , SUM((ranking - ranking_bar) * (cat_3 - cat_3_bar)) / SUM((ranking - ranking_bar) * (ranking - ranking_bar)) as slope_3
    , SUM((ranking - ranking_bar) * (cat_4 - cat_4_bar)) / SUM((ranking - ranking_bar) * (ranking - ranking_bar)) as slope_4
    , SUM((ranking - ranking_bar) * (cat_5 - cat_5_bar)) / SUM((ranking - ranking_bar) * (ranking - ranking_bar)) as slope_5
    , MAX(ranking_bar) as ranking_bar_max
    , MAX(cat_1_bar) as cat_1_bar_max
    , MAX(cat_2_bar) as cat_2_bar_max
    , MAX(cat_3_bar) as cat_3_bar_max
    , MAX(cat_4_bar) as cat_4_bar_max
    , MAX(cat_5_bar) as cat_5_bar_max
    from stat_projection_1
),
trend_line as (
    select slope_1, slope_2, slope_3, slope_4, slope_5
    , cat_1_bar_max - ranking_bar_max * slope_1 intercept_1
    , cat_2_bar_max - ranking_bar_max * slope_2 intercept_2
    , cat_3_bar_max - ranking_bar_max * slope_3 intercept_3
    , cat_4_bar_max - ranking_bar_max * slope_4 intercept_4
    , cat_5_bar_max - ranking_bar_max * slope_5 intercept_5
    from stat_projection_2
)
    select spp.*
    , round((spp.ranking * (select slope_1 from trend_line) + (select intercept_1 from trend_line)),2) as trend_line_1
    , round((spp.ranking * (select slope_2 from trend_line) + (select intercept_2 from trend_line)),2) as trend_line_2
    , round((spp.ranking * (select slope_3 from trend_line) + (select intercept_3 from trend_line)),2) as trend_line_3
    , round((spp.ranking * (select slope_4 from trend_line) + (select intercept_4 from trend_line)),2) as trend_line_4
    , round((spp.ranking * (select slope_5 from trend_line) + (select intercept_5 from trend_line)),2) as trend_line_5
    , (select slope_1 from trend_line)
    , (select slope_2 from trend_line)
    , (select slope_3 from trend_line)
    , (select slope_4 from trend_line)
    , (select slope_5 from trend_line)
    , (select intercept_1 from trend_line)
    , (select intercept_2 from trend_line)
    , (select intercept_3 from trend_line)
    , (select intercept_4 from trend_line)
    , (select intercept_5 from trend_line)
    from stat_projection_prep spp
)

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
4 rows affected.

[]

In [143]:
%%sql

select *
from training_values

 * postgresql://postgres:***@localhost:5432/dvdrental
4 rows affected.

[(1, '2005-5', 76, 74, 87, 84, 85, Decimal('80.10'), Decimal('88.70'), Decimal('94.50'), Decimal('92.80'), Decimal('90.30'), Decimal('140.60000000000000000000000000000000'), Decimal('131.70000000000000000000000000000000'), Decimal('119.50000000000000000000000000000000'), Decimal('120.30000000000000000000000000000000'), Decimal('120.30000000000000000000000000000000'), Decimal('-60.500000000000000000000000000000000000000000000000'), Decimal('-43.000000000000000000000000000000000000000000000000'), Decimal('-25.000000000000000000000000000000000000000000000000'), Decimal('-27.500000000000000000000000000000000000000000000000'), Decimal('-30.000000000000000000000000000000000000000000000000')),
 (2, '2005-6', 159, 174, 160, 162, 154, Decimal('220.70'), Decimal('220.40'), Decimal('214.00'), Decimal('213.10'), Decimal('210.60'), Decimal('140.60000000000000000000000000000000'), Decimal('131.70000000000000000000000000000000'), Decimal('119.50000000000000000000000000000000'), Decimal('120.30000000000000000000000000000000'), Decimal('120.30000000000000000000000000000000'), Decimal('-60.500000000000000000000000000000000000000000000000'), Decimal('-43.000000000000000000000000000000000000000000000000'), Decimal('-25.000000000000000000000000000000000000000000000000'), Decimal('-27.500000000000000000000000000000000000000000000000'), Decimal('-30.000000000000000000000000000000000000000000000000')),
 (3, '2005-7', 497, 489, 464, 462, 460, Decimal('361.30'), Decimal('352.10'), Decimal('333.50'), Decimal('333.40'), Decimal('330.90'), Decimal('140.60000000000000000000000000000000'), Decimal('131.70000000000000000000000000000000'), Decimal('119.50000000000000000000000000000000'), Decimal('120.30000000000000000000000000000000'), Decimal('120.30000000000000000000000000000000'), Decimal('-60.500000000000000000000000000000000000000000000000'), Decimal('-43.000000000000000000000000000000000000000000000000'), Decimal('-25.000000000000000000000000000000000000000000000000'), Decimal('-27.500000000000000000000000000000000000000000000000'), Decimal('-30.000000000000000000000000000000000000000000000000')),
 (4, '2005-8', 432, 408, 384, 385, 384, Decimal('501.90'), Decimal('483.80'), Decimal('453.00'), Decimal('453.70'), Decimal('451.20'), Decimal('140.60000000000000000000000000000000'), Decimal('131.70000000000000000000000000000000'), Decimal('119.50000000000000000000000000000000'), Decimal('120.30000000000000000000000000000000'), Decimal('120.30000000000000000000000000000000'), Decimal('-60.500000000000000000000000000000000000000000000000'), Decimal('-43.000000000000000000000000000000000000000000000000'), Decimal('-25.000000000000000000000000000000000000000000000000'), Decimal('-27.500000000000000000000000000000000000000000000000'), Decimal('-30.000000000000000000000000000000000000000000000000'))]

<a id='Section-5-Projecting-next-6-months'></a>

---

## Projections for the next 6 months are below

#### We should note, that with only 4 months of training data, these forecasts should be taken with a grain of salt. Further analysis should be done to determine whether these trend lines actually approximate our historical data in a meaningful way. This could be conducted by:
* Performing stastical tests like the squared error, mean squared error, or root mean squared error

### Execution notes:
* The initial CTE serves to generate the number of data points, or horizon, of our forecast
* The second CTE associates the month_year with our forecasted values
* The third CTE (model_components) brings our slope and intercept data into our context

In [132]:
%%sql

-- We are extrapolating out the interval of date units (months, in this case) where we want to produce a linear forecast
-- Part of this exercise also includes creating a column for the human-interprettable months forecasted

with forecast_range as (
select ranking
    from training_values
    
    union all
    
    select * from generate_series(5,10) as ranking
),
forecast_range_readable as (

    select ds.ranking
    , date_trunc('month',to_date((select month_year from training_values where ranking = 1),'YYYY-MM'))
    + (interval '1' month * (ranking - 1)) as month_year
    from forecast_range ds
    order by ranking asc

),
model_components as (
    select slope_1, slope_2, slope_3, slope_4, slope_5
        , intercept_1, intercept_2, intercept_3, intercept_4, intercept_5
    from training_values tv
    group by 1,2,3,4,5,6,7,8,9,10
)
select frr.ranking
, frr.month_year
, round((frr.ranking * (select slope_1 from model_components) + (select intercept_1 from model_components)),2) as cat_1_projected
, round((frr.ranking * (select slope_2 from model_components) + (select intercept_2 from model_components)),2) as cat_2_projected
, round((frr.ranking * (select slope_3 from model_components) + (select intercept_3 from model_components)),2) as cat_3_projected
, round((frr.ranking * (select slope_4 from model_components) + (select intercept_4 from model_components)),2) as cat_4_projected
, round((frr.ranking * (select slope_5 from model_components) + (select intercept_5 from model_components)),2) as cat_5_projected
from forecast_range_readable frr

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(1, datetime.datetime(2005, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=61200))), Decimal('80.10'), Decimal('88.70'), Decimal('94.50'), Decimal('92.80'), Decimal('90.30')),
 (2, datetime.datetime(2005, 6, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=61200))), Decimal('220.70'), Decimal('220.40'), Decimal('214.00'), Decimal('213.10'), Decimal('210.60')),
 (3, datetime.datetime(2005, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=61200))), Decimal('361.30'), Decimal('352.10'), Decimal('333.50'), Decimal('333.40'), Decimal('330.90')),
 (4, datetime.datetime(2005, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=61200))), Decimal('501.90'), Decimal('483.80'), Decimal('453.00'), Decimal('453.70'), Decimal('451.20')),
 (5, datetime.datetime(2005, 9, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=61200))), Decimal('642.50'), Decimal('615.50'), Decimal('572.50'), Decimal('574.00'), Decimal('571.50')),
 (6, datetime.datetime(2005, 10, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=61200))), Decimal('783.10'), Decimal('747.20'), Decimal('692.00'), Decimal('694.30'), Decimal('691.80')),
 (7, datetime.datetime(2005, 11, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=57600))), Decimal('923.70'), Decimal('878.90'), Decimal('811.50'), Decimal('814.60'), Decimal('812.10')),
 (8, datetime.datetime(2005, 12, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=57600))), Decimal('1064.30'), Decimal('1010.60'), Decimal('931.00'), Decimal('934.90'), Decimal('932.40')),
 (9, datetime.datetime(2006, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=57600))), Decimal('1204.90'), Decimal('1142.30'), Decimal('1050.50'), Decimal('1055.20'), Decimal('1052.70')),
 (10, datetime.datetime(2006, 2, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=57600))), Decimal('1345.50'), Decimal('1274.00'), Decimal('1170.00'), Decimal('1175.50'), Decimal('1173.00'))]